snanalysis_manager.org
#+TITLE:  SNAnalysis Manager Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-03-13
#+OPTIONS: toc:nil
#+LATEX_CMD: xelatex

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

This file holds mainly modules in relation with "plotting" results. Since its
configuration may change a lot between debug, tests, analysis thematics and since
its role is slightly different to other reconstruction modules, it is assumed to
be simpler to have it alone.

As write before, it mainly holds "plot" modules with there configurations.

* Plot modules
:PROPERTIES:
:CUSTOM_ID: plot_modules
:TANGLE: plot_modules.conf
:END:

This section holds all the module related to histogram plotting. Historically,
most of them are pretty simple modules. Recently, an =histogram_service= has
been provided so latest plot modules make use of it (see =basic_plot= module for
example). This module can not be as generic as processing module. Basically, for
one study purpose, there is one or two plot modules.

#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

** Basic plot module
#+BEGIN_SRC sh
  [name="basic_plot" type="snemo::analysis::processing::basic_plot_module"]

  #@config 'snemo::analysis::processing::basic_plot_module' configuration parameters

  #@description Debug flag
  debug     : boolean = 0

  #@description The Histogram Service label
  Histo_label : string = "Histo"

  #@description The label of the 'Event Header' bank
  EH_label : string  = "EH"

  #@description The label of the 'Simulated Data' bank
  SD_label : string  = "SD"
#+END_SRC

** Study calorimeter block size for SuperNEMO (deprecated)
#+BEGIN_SRC sh :tangle no
  [name="snemo_block_size" type="snemo::analysis::processing::snemo_block_size_module"]

  #@config 'snemo::analysis::processing::snemo_block_size' configuration parameters

  #@description Debug flag
  debug     : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Analysed Data' bank
  AD_label : string  = "ANA"
#+END_SRC

** Study calorimeter energy resolution for SuperNEMO (deprecated)
#+BEGIN_SRC sh :tangle no
  [name="snemo_energy_resolution" type="snemo::analysis::processing::snemo_energy_resolution_module"]

  #@config 'snemo::analysis::processing::snemo_energy_resolution' configuration parameters

  #@description Debug flag
  debug     : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Analysed Data' bank
  AD_label : string  = "ANA"
#+END_SRC
** Study particle track result
*** Particle charge
#+BEGIN_SRC sh
  [name="snemo_particle_charge" type="snemo::analysis::processing::snemo_particle_charge_module"]

  #@description Debug flag
  debug     : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label : string  = "EH"

  #@description The label of the 'Simulated Data' bank
  SD_label : string  = "SD"

  #@description The label of the 'Particle Track Data' bank
  PTD_label : string  = "PTD"
#+END_SRC
*** Vertex resolution
#+BEGIN_SRC sh
  [name="snemo_vertex_resolution" type="snemo::analysis::processing::snemo_vertex_resolution_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description Vertex reconstruction either on 'foil', 'calo' or 'xcalo'
  parameter   : string = "calo"

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Simulated Data' bank
  SD_label    : string  = "SD"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"
#+END_SRC

