snanalysis_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SNAnalysis Manager Configuration</title>
<!-- 2013-10-20 dim. 01:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css">
                 <link rel="stylesheet" href="css/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
<a href="simulation_config.html">main</a>
                     <a href="sngeometry_manager.html">geometry manager</a>
                     <a href="sng4_manager.html">G4 manager</a>
                     <a href="step_hit_processor_factory.html">step hit processor</a>
                     <a href="sngenbb_manager.html">genbb manager</a>
                     <a href="snanalysis_manager.html">analysis</a>
</div>
<div id="content">
<h1 class="title">SNAnalysis Manager Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Plot modules</a>
<ul>
<li><a href="#sec-2-1">2.1. Basic plot module</a></li>
<li><a href="#sec-2-2">2.2. Study calorimeter block size for SuperNEMO (deprecated)</a></li>
<li><a href="#sec-2-3">2.3. Study calorimeter energy resolution for SuperNEMO (deprecated)</a></li>
<li><a href="#sec-2-4">2.4. Study particle track result</a></li>
<li><a href="#sec-2-5">2.5. &beta;&beta;&nu;&nu; analysis</a></li>
<li><a href="#sec-2-6">2.6. Detector efficiency</a></li>
<li><a href="#sec-2-7">2.7. BiPo plot module</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Histogram templates</a>
<ul>
<li><a href="#sec-3-1">3.1. Energy template</a></li>
<li><a href="#sec-3-2">3.2. Efficiency template</a></li>
<li><a href="#sec-3-3">3.3. Halflife limit template</a></li>
<li><a href="#sec-3-4">3.4. Source foil vertices distribution</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file holds mainly modules in relation with "plotting" results. Since its
configuration may change a lot between debug, tests, analysis thematics and since
its role is slightly different to other reconstruction modules, it is assumed to
be simpler to have it alone.
</p>

<p>
As write before, it mainly holds "plot" modules with there configurations.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Plot modules</h2>
<div class="outline-text-2" id="text-2">
<p>
This section holds all the module related to histogram plotting. Historically,
most of them are pretty simple modules. Recently, an <code>histogram_service</code> has
been provided so latest plot modules make use of it (see <code>basic_plot</code> module for
example). This module can not be as generic as processing module. Basically, for
one study purpose, there is one or two plot modules.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Basic plot module</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"basic_plot"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::basic_plot_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config 'snemo::analysis::processing::basic_plot_module' configuration parameters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug     : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Study calorimeter block size for SuperNEMO (deprecated)</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_block_size"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_block_size_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config 'snemo::analysis::processing::snemo_block_size' configuration parameters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug     : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Analysed Data' bank</span>
AD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"ANA"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Study calorimeter energy resolution for SuperNEMO (deprecated)</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_energy_resolution"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_energy_resolution_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config 'snemo::analysis::processing::snemo_energy_resolution' configuration parameters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug     : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Analysed Data' bank</span>
AD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"ANA"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Study particle track result</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1">Particle charge</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_particle_charge"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_particle_charge_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug     : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2">Vertex resolution</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_vertex_resolution"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_vertex_resolution_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Vertex reconstruction either on 'foil', 'calo' or 'xcalo'</span>
parameter   : <span class="org-variable-name">string</span> = <span class="org-string">"calo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>
