snanalysis_manager.org
*** Vertex distribution
#+BEGIN_SRC sh
  [name="snemo_vertex_distribution" type="snemo::analysis::processing::snemo_vertex_distribution_module"]

  #@description Debug flag
  debug     : boolean = 1

  #@description The Histogram Service label
  Histo_label : string = "Histo"

  #@description The label of the 'Particle Track Data' bank
  PTD_label : string  = "PTD"
#+END_SRC

*** Study track fit quality
#+BEGIN_SRC sh
  [name="snemo_particle_reduced_chi2" type="snemo::analysis::processing::snemo_particle_track_parameters_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Simulated Data' bank
  SD_label    : string  = "SD"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"
#+END_SRC

*** Study fit curvature
#+BEGIN_SRC sh
  [name="snemo_particle_curvature" type="snemo::analysis::processing::snemo_particle_track_parameters_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description Parameter to be plot (either 'reduced_chi2' or 'curvature')
  parameter   : string = "curvature"

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Simulated Data' bank
  SD_label    : string  = "SD"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"
#+END_SRC
** \beta\beta\nu\nu analysis
*** Discrimination
#+BEGIN_SRC sh
  [name="snemo_bb0nu_discrimination" type="snemo::analysis::processing::snemo_bb0nu_discrimination_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"
#+END_SRC

*** Calculation of halflife limit
#+BEGIN_SRC sh
  [name="snemo_bb0nu_halflife_limit" type="snemo::analysis::processing::snemo_bb0nu_halflife_limit_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"

  #@description The Histogram Service label
  Histo_label : string = "Histo"
#+END_SRC

The key fields are used to build different key for histogram dictionnary. The
basic idea is to have this information inside =event_header= and use it to build
a =string= key. The program is then quite dynamic in the sense that 0\nu
halflife calculation can be done for different study purpose (just change the =key_fields=).
#+BEGIN_SRC sh
  #@description The key fields from 'Event Header' bank to build a unique key for histogram
  key_fields : string[2] =       \
      "analysis.decay_process"   \
      "analysis.calo_resolution"
#+END_SRC

Experimental conditions:
#+BEGIN_SRC sh
  #@description The atomic mass number of the isotope
  experiment.isotope_mass_number : integer = 82

  #@description The total mass of the isotope
  experiment.isotope_mass : string = "5 kg"

  #@description The bb2nu halflife of the isotope
  experiment.isotope_bb2nu_halflife : real = 9.0e19 #year

  #@description The exposure time of the experiment
  experiment.exposure_time : real = 2.0 #year
#+END_SRC

