snanalysis_manager.html
<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3">Vertex distribution</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_vertex_distribution"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_vertex_distribution_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
bank_label : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4-4" class="outline-4">
<h4 id="sec-2-4-4">Study track fit quality</h4>
<div class="outline-text-4" id="text-2-4-4">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_particle_reduced_chi2"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_particle_track_parameters_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4-5" class="outline-4">
<h4 id="sec-2-4-5">Study fit curvature</h4>
<div class="outline-text-4" id="text-2-4-5">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_particle_curvature"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_particle_track_parameters_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Parameter to be plot (either 'reduced_chi2' or 'curvature')</span>
parameter   : <span class="org-variable-name">string</span> = <span class="org-string">"curvature"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> &beta;&beta;&nu;&nu; analysis</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1">Discrimination</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_bb0nu_discrimination"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_bb0nu_discrimination_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2">Calculation of halflife limit</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_bb0nu_halflife_limit"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_bb0nu_halflife_limit_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>
</pre>
</div>

<p>
The key fields are used to build different key for histogram dictionnary. The
basic idea is to have this information inside <code>event_header</code> and use it to build
a <code>string</code> key. The program is then quite dynamic in the sense that 0&nu;
halflife calculation can be done for different study purpose (just change the <code>key_fields</code>).
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The key fields from 'Event Header' bank to build a unique key for histogram</span>
key_fields : <span class="org-variable-name">string</span>[2] =       <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"analysis.decay_process"</span>   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"analysis.calo_resolution"</span>
</pre>
</div>

<p>
Experimental conditions:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The atomic mass number of the isotope</span>
experiment.isotope_mass_number : <span class="org-variable-name">integer</span> = 82

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The total mass of the isotope</span>
experiment.isotope_mass : <span class="org-variable-name">string</span> = <span class="org-string">"5 kg"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The bb2nu halflife of the isotope</span>
experiment.isotope_bb2nu_halflife : <span class="org-variable-name">real</span> = 9.0e19 <span class="org-comment-delimiter">#</span><span class="org-comment">year</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The exposure time of the experiment</span>
experiment.exposure_time : <span class="org-variable-name">real</span> = 2.0 <span class="org-comment-delimiter">#</span><span class="org-comment">year</span>
</pre>
</div>
</div>
</div>
