snanalysis_manager.org
*** \beta\beta spectrum (not existing anymore)
#+BEGIN_SRC sh :tangle no
  [name="snemo_bb_energy_spectra" type="snemo::analysis::processing::snemo_bb_energy_spectra_module"]

  #@config 'snemo::analysis::processing::snemo_bb_energy_spectra' configuration parameters

  #@description Debug flag
  debug       : boolean = 0

  #@description Interactive flag (ROOT window popup)
  interactive : boolean = 1

  #@description The label of the 'Event Header' bank
  EH_label    : string  = "EH"

  #@description The label of the 'Particle Track Data' bank
  PTD_label   : string  = "PTD"

  #@description The key fields from 'Event Header' bank to build a unique key for histogram
  key_fields : string [3] = "analysis.source_isotope" \
                            "analysis.decay_process"  \
                            "analysis.calo_resolution"

  #@description The number of energy bins for two electrons energy distribution
  nbr_of_energy_bins : integer = 25

  #@description The minimal two electrons energy
  minimal_norm_energy : real = 0.7

  #@description The maximal two electrons energy
  maximal_norm_energy : real = 1.05

  #@description The atomic mass number of the isotope
  isotope_mass_number : integer = 150

  #@description The total mass of the isotope
  isotope_mass : string = "7 kg"

  #@description The total mass of the isotope
  isotope_qbb : string = "3368 keV"

  #@description The bb2nu halflife of the isotope
  isotope_bb2nu_halflife : real = 9.1e18 #year

  #@description The bb0nu halflife of the isotope
  isotope_bb0nu_halflife : real = 1.56978e+23 #year

  #@description The exposure time of the experiment
  exposure_time : real = 2.0 #year
#+END_SRC

** Detector efficiency
This module computes the efficiency for \beta\beta0\nu per calorimeter
blocks.
#+BEGIN_SRC sh
  [name="snemo_detector_efficiency" type="snemo::analysis::processing::snemo_detector_efficiency_module"]

  #@description Debug flag
  debug       : boolean = 0

  #@description The label of the Geometry service
  Geo_label : string  = "Geo"

  #@description The label of the bank
  bank_label : string  = "PTD"
#+END_SRC

** BiPo plot module
This module plots BiPo alpha track fit and then compares start time
determination.

#+BEGIN_SRC sh
  [name="BiPo_alpha_track" type="snemo::analysis::processing::snemo_Bi214_Po214_alpha_track_module"]

  #@config 'snemo::analysis::processing::basic_plot_module' configuration parameters

  #@description Debug flag
  debug     : boolean = 1

  #@description The Histogram Service label
  Histo_label : string = "Histo"

  #@description The label of the 'Simulated Data' bank
  SD_label : string  = "SD"

  #@description The label of the 'Particle Track Data' bank
  PTD_label : string  = "PTD"
#+END_SRC

* Histogram templates
:PROPERTIES:
:CUSTOM_ID: histogram_templates
:TANGLE:   histogram_templates.conf
:END:

Histogram declarations are done in this file where several informations can be
passed to the histogram service. There is also a possibility to declare
"template" histogram from which several histograms can refered to. These
group histograms will share the same binning, axis labels ...

** Preamble
#+BEGIN_SRC sh
  #@description A sample list of setups
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

** Energy template
#+BEGIN_SRC sh
  [name="energy_template" type="mygsl::histogram_1d"]
  #@description The title of the histogram (optional)
  title : string = ""

  #@description The group of the histogram (optional)
  group : string = "__template"

  #@description The build mode (default : "regular", "table", "mimic");
  mode : string = "regular"

  #@description The linear mode (default)
  linear : boolean = 1

  #@description The X axis label
  display.xaxis.label : string = "$\Upsigma_\text{\tiny 1,2}$E$_\text{calibrated}$"

  #@description The X axis unit for display (a standard unit, typically SI or CLHEP)
  display.xaxis.unit : string = "keV"

  #@description The Y axis label
  display.yaxis.label : string = "dN/dE [A.U.]"

  #@description The number of bins
  number_of_bins : integer = 25

  #@description The unit of the bins' bounds (a standard unit, typically SI or CLHEP)
  unit : string = "keV"

  #@description The lower bound of the histogram
  min : real = 2000.0

  #@description The upper bound of the histogram
  max : real = 3200.0
#+END_SRC

