snanalysis_manager.html
<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3">&beta;&beta; spectrum (not existing anymore)</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_bb_energy_spectra"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_bb_energy_spectra_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config 'snemo::analysis::processing::snemo_bb_energy_spectra' configuration parameters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Interactive flag (ROOT window popup)</span>
interactive : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Event Header' bank</span>
EH_label    : <span class="org-variable-name">string</span>  = <span class="org-string">"EH"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label   : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The key fields from 'Event Header' bank to build a unique key for histogram</span>
key_fields : string [3] = <span class="org-string">"analysis.source_isotope"</span> <span class="org-sh-escaped-newline">\</span>
                          <span class="org-string">"analysis.decay_process"</span>  <span class="org-sh-escaped-newline">\</span>
                          <span class="org-string">"analysis.calo_resolution"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of energy bins for two electrons energy distribution</span>
nbr_of_energy_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The minimal two electrons energy</span>
minimal_norm_energy : <span class="org-variable-name">real</span> = 0.7

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The maximal two electrons energy</span>
maximal_norm_energy : <span class="org-variable-name">real</span> = 1.05

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The atomic mass number of the isotope</span>
isotope_mass_number : <span class="org-variable-name">integer</span> = 150

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The total mass of the isotope</span>
isotope_mass : <span class="org-variable-name">string</span> = <span class="org-string">"7 kg"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The total mass of the isotope</span>
isotope_qbb : <span class="org-variable-name">string</span> = <span class="org-string">"3368 keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The bb2nu halflife of the isotope</span>
isotope_bb2nu_halflife : <span class="org-variable-name">real</span> = 9.1e18 <span class="org-comment-delimiter">#</span><span class="org-comment">year</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The bb0nu halflife of the isotope</span>
isotope_bb0nu_halflife : <span class="org-variable-name">real</span> = 1.56978e+23 <span class="org-comment-delimiter">#</span><span class="org-comment">year</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The exposure time of the experiment</span>
exposure_time : <span class="org-variable-name">real</span> = 2.0 <span class="org-comment-delimiter">#</span><span class="org-comment">year</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Detector efficiency</h3>
<div class="outline-text-3" id="text-2-6">
<p>
This module computes the efficiency for &beta;&beta;0&nu; per calorimeter
blocks.
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"snemo_detector_efficiency"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_detector_efficiency_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug       : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the Geometry service</span>
Geo_label : <span class="org-variable-name">string</span>  = <span class="org-string">"Geo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the bank</span>
bank_label : <span class="org-variable-name">string</span>  = <span class="org-string">"CD"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> BiPo plot module</h3>
<div class="outline-text-3" id="text-2-7">
<p>
This module plots BiPo alpha track fit and then compares start time
determination.
</p>

<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"BiPo_alpha_track"</span> <span class="org-variable-name">type</span>=<span class="org-string">"snemo::analysis::processing::snemo_Bi214_Po214_alpha_track_module"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config 'snemo::analysis::processing::basic_plot_module' configuration parameters</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Debug flag</span>
debug     : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Histogram Service label</span>
Histo_label : <span class="org-variable-name">string</span> = <span class="org-string">"Histo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Simulated Data' bank</span>
SD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"SD"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The label of the 'Particle Track Data' bank</span>
PTD_label : <span class="org-variable-name">string</span>  = <span class="org-string">"PTD"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Histogram templates</h2>
<div class="outline-text-2" id="text-3">
<p>
Histogram declarations are done in this file where several informations can be
passed to the histogram service. There is also a possibility to declare
"template" histogram from which several histograms can refered to. These
group histograms will share the same binning, axis labels &#x2026;
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Energy template</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"energy_template"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">""</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"__template"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"$\Upsigma_\text{\tiny 1,2}$E$_\text{calibrated}$"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.xaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"dN/dE [A.U.]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The unit of the bins' bounds (a standard unit, typically SI or CLHEP)</span>
unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = 2000.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 3200.0
</pre>
</div>
</div>
</div>
