snanalysis_manager.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Efficiency template</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"efficiency_template"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the energy selection efficiency</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">""</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"__template"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"$\Upsigma_\text{\tiny 1,2}\text{E}_\text{calibrated}\geq\text{E}_\text{cut}$"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.xaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"efficiency"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The unit of the bins' bounds (a standard unit, typically SI or CLHEP)</span>
unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = 2000.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 3200.0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Halflife limit template</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"halflife_template"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_1d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config The histogram of the energy selection efficiency</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">""</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"__template"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"$\Upsigma_\text{\tiny 1,2}\text{E}_\text{calibrated}\geq\text{E}_\text{cut}$"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.xaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"halflife limit"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The number of bins</span>
number_of_bins : <span class="org-variable-name">integer</span> = 25

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The unit of the bins' bounds (a standard unit, typically SI or CLHEP)</span>
unit : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
min : <span class="org-variable-name">real</span> = 2000.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
max : <span class="org-variable-name">real</span> = 3200.0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Source foil vertices distribution</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"vertex_distribution_template"</span> <span class="org-variable-name">type</span>=<span class="org-string">"mygsl::histogram_2d"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The title of the histogram (optional)</span>
title : <span class="org-variable-name">string</span> = <span class="org-string">""</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The group of the histogram (optional)</span>
group : <span class="org-variable-name">string</span> = <span class="org-string">"__template"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The build mode (default : "regular", "table", "mimic");</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"regular"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
x.linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X bin unit</span>
x.unit : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
x.min : <span class="org-variable-name">real</span> = -2500.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
x.max : <span class="org-variable-name">real</span> = +2500.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
x.number_of_bins : <span class="org-variable-name">integer</span> = 100

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The linear mode (default)</span>
y.linear : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X bin unit</span>
y.unit : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The lower bound of the histogram</span>
y.min : <span class="org-variable-name">real</span> = -1500.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
y.max : <span class="org-variable-name">real</span> = +1500.0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The upper bound of the histogram</span>
y.number_of_bins : <span class="org-variable-name">integer</span> = 100

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis label</span>
display.xaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"y"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The X axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.xaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis label</span>
display.yaxis.label : <span class="org-variable-name">string</span> = <span class="org-string">"z"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The Y axis unit for display (a standard unit, typically SI or CLHEP)</span>
display.yaxis.unit : <span class="org-variable-name">string</span> = <span class="org-string">"mm"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit 9e0ccea - 26 minutes ago
</div>
</body>
</html>
